[
    {
        "id": 1,
        "name": "Battery",
        "description": "The battery in a car is a rechargeable. It supplies power (electric energy) to the car. Normally this battery is used to help provide power to start the car and then it is used only when extra power is needed. The car battery alone is can't supply power to all the electrical systems.The alternator does this.",
        "advice": "Turn off car lights and accessories ",
        "imgUrl": "https://drivinglife.net/wp-content/uploads/2016/07/Problem-with-Wrong-Battery.jpg",
        "price": 6000
    },
    {
        "id": 2,
        "name": "Brakes",
        "description": "Usually, your car has two kinds of breaking systems. The first one is the brakes pedal that you use to stop the car as you press on it with your foot. The second break system is the emergency break. It works independently from the pedal and sometimes looks like a rod you pull up on or a small pedal you press down on. ",
        "advice": "Regular care should be taken to replace brake pads when needed and maintain parts in good working order. This can save your life as well as save you money",
        "imgUrl": "https://drivinglife.net/wp-content/uploads/2019/07/mercedes-1464855_1280.webp",
        "price": 1200
    },
    {
        "id": 3,
        "name": "Axle",
        "description": "The axle is a bar or shaft used in turning the wheels. The transmission helps turn the axle, that turns the wheels. There is sometimes a front axle and a back axle that usually has a differential in the middle that joins the front pair of tires and back pair so they move at the same time. Since an axle is a solid metal, it is difficult to break it.",
        "advice": "Cleaning the undercarriage, if salt is used on the road, and driving carefully on rough roads will protect your axle.",
        "imgUrl": "https://m.media-amazon.com/images/I/41xhmGK-yWL._SL600_.jpg",
        "price": 500
    },
    {
        "id": 4,
        "name": "Fuel Injector",
        "description": "This small part helps provide fuel to the engine. It uses a nozzle to deliver just the right amount of fuel to the combustion chamber. It is electronically controlled and helps with fuel efficiency.",
        "advice": "If you clean the fuel injector, then your car may perform better.",
        "imgUrl": "https://m.media-amazon.com/images/I/41lRswrcIkL._SL600_.jpg",
        "price": 900
    },
    {
        "id": 5,
        "name": "Piston",
        "description": "An average car will have four to six pistons in the engine. Pistons move when an explosion of gas occurs in the combustion chamber. As the pistons move, they turn the crank shaft, helping the car to deliver power to the tires, so the car can move. speed of the engine is directly proportional to the moving pistons. When fuel and air mix together and enter the combustion chamber; they are ignited by the spark plugs creating the explosion that moves the piston.These pistons are cylinders that move up and down.",
        "advice": "Like the fuel injectors, pistons can get dirty and may need cleaning to perform their best.",
        "imgUrl": "https://drivinglife.net/wp-content/uploads/2019/07/motor-2154575_1280.webp",
        "price": 5200
    },
    {
        "id": 6,
        "name": "A/C Compressor",
        "description": "The air that is blown inside your car's cabin can be cold. The A/C compressor is at the heart of this process. It compresses refrigerant, so the refrigerant can change from a gas to a liquid. When it's a gas it can absorb heat making the air cold as it blows over it. The AC compressor can operate well as long as there are no leaks in the system or other problems, like a broken radiator fan.",
        "advice": "If you get your car service regularly, they should check the AC system. ",
        "imgUrl": "https://drivinglife.net/wp-content/uploads/2017/03/ACCompressor.gif",
        "price": 3500
    },
    {
        "id": 7,
        "name": "Radiator",
        "description": "The radiator is used to help the engine cool down so it can operate without overheating. It cools the radiator fluid the goes through the engine where it is heated up. As it travels back to the radiator the heat is transfers to the metal fins and air, as the fan blows over it. A radiator keeps your car engine running at normal operating temperature.The coolant(antifreeze) in the radiator can change the boiling and freezing point of the water that it is mixed with it(normal 50 % water and 50 % antifreeze).",
        "advice": "Lastly, if the radiator has dirt or particles covering the metal fins, make sure to clean it off.",
        "imgUrl": "https://m.media-amazon.com/images/I/51YV4H1zPJL._SL600_.jpg",
        "price": 750
    },
    {
        "id": 8,
        "name": "Engine Fan",
        "description": "Fans are know for being very reliable. Your car's fan cools the radiator (with antifreeze inside) and condenser (with refrigerant inside). This helps the engine and AC system maintain the proper operating temperatures. To maintain the fan, check for anything that could block the fan.The engine fan can blown particles into the fins of the radiator and condenser, blocking air flow.",
        "advice": "Clean off any debris from the metal fins of the radiator and condenser, to prevent overheating.",
        "imgUrl": "https://m.media-amazon.com/images/I/41D9d3YKyfL._SL600_.jpg",
        "price": 300
    },
    {
        "id": 9,
        "name": "Clutch",
        "description": "The clutch is a mechanism that helps to transfer power from the engine to the transmission. In a manual transmission car, also known as a stick shift, the clutch is operated by the clutch pedal. The clutch pedal is located on the left side of the other two pedals. When you step on the clutch, the power from the engine is no longer going to the wheels.This allows you to change gears and increase or decrease the power and speed of the wheels. ",
        "advice": "To maintain your clutch, learn to use it correctly, and drive at normal speeds. ",
        "imgUrl": "https://m.media-amazon.com/images/I/51aTFcssFdL._SL600_.jpg",
        "price": 1500
    },
    {
        "id": 10,
        "name": "Car Jack",
        "description": "A car jack is a simple device that helps to lift the car, when you need to change a tire. There are many types of car jacks that can lift lighter or heavier cars. You car should have an emergency car jack included. Some car jacks are mechanical and some are hydraulic.A hydraulic car jack is often easier to use but heavier, and most people store them in the garage, not their car. ",
        "advice": "Keep a jack and spare tire in the car at all times to prevent long waits or being left alone and by yourself.   ",
        "imgUrl": "https://drivinglife.net/wp-content/uploads/2017/03/Car-Jack.gif",
        "price": 1800
    },
    {
        "id": 11,
        "name": "Spare Tire",
        "description": "The spare tire is an important part of driving a car. It provides peace of mind and the ability to drive your car until you get your flat tire fixed. This safety precautionary will help in case your car tire runs flat. Whether you do it yourself or have someone help you, changing your tires will help you get to where you need to go without having to wait for long periods. ",
        "advice": "To make sure your ready at any time for a flat tire ensure the spare tire is pressurized to the correct PSI and inspect it every 6 months. ",
        "imgUrl": "https://drivinglife.net/wp-content/uploads/2017/02/how-to-use-impact-drivers.jpg",
        "price": 750
    },
    {
        "id": 12,
        "name": "Transmission",
        "description": "The transmission is how the car changes gears. It allows a car to climb up steep hills and move quickly. Sometimes it is called the gear box. The transmission helps to transfer the energy from the engine to the wheel axle, where energy is applied to the wheels of the car. Most cars have an automatic transmission, but some cars are manual transmission.You can find cars for a cheaper price that have a manual transmission(stick shift) and many sports cars also use these.",
        "advice": "To keep the transmission working well inspect the transmission fluid levels every month and its color about every 6 months.",
        "imgUrl": "https://drivinglife.net/wp-content/uploads/2016/08/automatic-transmissions.jpg",
        "price": 3700
    },
    {
        "id": 13,
        "name": "Shock Absorbers",
        "description": "A shock absorber is a device used to dampen the bumps and rough spots in the road. There are various types including pneumatic (gas filled), magnetic, hydraulic (liquid filled), and some also add springs.  The shock absorber will absorb the vibrations caused while driving.When a car is in motion, you can feel the vibration from the tires throughout the car.A shock absorber can take that energy and smooth out the ride.",
        "advice": "Maintaining your shock is a matter of noticing when they no longer work well.",
        "imgUrl": "https://m.media-amazon.com/images/I/41ZcpUsIppS._SL600_.jpg",
        "price": 655
    },
    {
        "id": 14,
        "name": "Air Filter",
        "description": "There are generally two types of air filters in your car. The first kind of air filter is for the engine of your a car. T﻿he other ai﻿r filter cleans the air coming into the cabin, so passengers have clean air. The engine needs air for combustion, and it is drawn through the filter into the combustion chamber.Dirt and particles in the air could create problems if not filtered.In addition, a dirty filter blocks air flow.So changing the air filter when dirty, will prevent damage and give better fuel economy.",
        "advice": "Some air filter are good at filtering dust and tiny particles if you have allergies.",
        "imgUrl": "https://m.media-amazon.com/images/I/319I5GOrcmL._SL600_.jpg",
        "price": 875
    },
    {
        "id": 15,
        "name": "Spark Plug",
        "description": "A spark plug is used in the combustion chamber to ignite the gas/fuel. It is timed to work with the cylinder and goes as slow or as fast as the engine RPMs. The spark must be effective in order for combustion to occur correctly. A misfire, rough idling,  or knocking can occur when spark plugs are not working correctly. To check your spark plugs you'll need to be aware of how your engine is running. Replacement might be needed if symptoms mentioned are occurring.",
        "advice": "The life span of a spark can be from 10,000 miles to 100,000 miles depending on the type and engine factors.",
        "imgUrl": "https://m.media-amazon.com/images/I/3111NqTIMxL._SL600_.jpg",
        "price": 90
    },
    {
        "id": 16,
        "name": "Catalytic Converter",
        "description": "The catalytic converter filters harmful gases (carbon monoxide, hydrocarbons, and oxides of nitrogen), so only water and carbon dioxide come out. This helps the environment. The exhaust from the engine goes into the catalytic converter, gets filtered, then enters the muffler.The catalytic converter can last the life of the car, but it can also get clogged or damaged.Usually you wont need to worry about the catalytic converter, but if you suspect a problem make sure to get it replaced if needed.",
        "advice": "Always make sure to replace one if it is broken. Driving without it is illegal. It is an easily fixable part, although it may be quite expensive.",
        "imgUrl": "https://m.media-amazon.com/images/I/416gwhrQ3NL._SL600_.jpg",
        "price": 598
    },
    {
        "id": 17,
        "name": "Muffler",
        "description": "If you've even been in a loud environment, and put on your headphone, you may have noticed the sound is dampened quite a bit. A similar process happens with the muffler.The very loud noises that comes from the engine are canceled out and reduced by reflecting off the walls of several chambers in the muffler.The sound that is then left exits the muffler and is released.Mufflers are great at reducing sound and the engine would produce very loud noises without it.",
        "advice": "If you hear loud engine noises from your car, get your muffler checked.",
        "imgUrl": "https://m.media-amazon.com/images/I/41iMMJdZmrL._SL600_.jpg",
        "price": 605
    },
    {
        "id": 18,
        "name": "Tire Pressure Gauge",
        "description": "This device is not a part of a car, rather it can be used to measure the tire pressure. Your tires need to be checked every month or more often if needed. Tires with the correct air pressure will cause less tire wear, get better gas mileage, have better shock absorption of the road, and give better handling. The correct tire pressure is usually located on a sticker you'll see if you open the drivers side door. ",
        "advice": "Try to get as close to the PSI (pounds per square inch) for each tire as possible without going over. ",
        "imgUrl": "https://m.media-amazon.com/images/I/41X4NghaGLL._SL600_.jpg",
        "price": 350
    },
    {
        "id": 19,
        "name": "Alternator",
        "description": "The alternator helps power all the electrical system of the car. After the batteries helps start the engine, the alternator takes over by producing electrical power to charge the battery and help power the cars electrical needs. As the engine runs it help move the the belt that is connected to the alternator, so it can produce energy.",
        "advice": "If you use a multimeter you can check the health (see video) of the alternator yourself.",
        "imgUrl": "https://m.media-amazon.com/images/I/51o6HZb+tML._SL600_.jpg",
        "price": 465
    },
    {
        "id": 20,
        "name": "Power Steering Fluid",
        "description": "Most cars have power steering. The power steering system helps pump power steering fluid to hydraulic piston. The piston helps make turning the wheels easier. To ensure that everything is working correctly, you can check the power steering fluid level around every month and the color every 6 months.",
        "advice": "If you notice the fluid color is fairly dark, its probably gone past the replacement date. It should be replaced according the owners manual suggestion.",
        "imgUrl": "https://drivinglife.net/wp-content/uploads/2016/10/Engine-Oils.jpg",
        "price": 989
    }
]